// File: chuong6.js
const vocabChuong6 = {
    // Nhóm 1 (V1 - Động từ đuôi ~u)
    "Rửa": "洗う (あらう)",
    "Học": "習う (ならう)",
    "Gặp": "会う (あう)",
    "Mua": "買う (かう)",
    "Đi": "行く (いく)",
    "Viết": "書く (かく)",
    "Nghe": "聞く (きく)",
    "Bơi": "泳ぐ (およぐ)",
    "Nói chuyện": "話す (はなす)",
    "Chờ, đợi": "待つ (まつ)",
    "Chơi": "遊ぶ (あそぶ)",
    "Đọc": "読む (よむ)",
    "Uống": "飲む (のむ)",
    "Nghỉ ngơi": "休む (やすむ)",
    "Nấu ăn, làm ra": "作る (つくる)",
    "Về, quay về, trở về": "帰る (かえる)",
    "Quay lại": "戻る (もどる)",

    // Nhóm 2 (V2 - Động từ đuôi ~iru / ~eru)
    "Ăn": "食べる (たべる)",
    "Ngủ": "寝る (ねる)",
    "Chỉ, dạy": "教える (おしえる)",
    "Xem, nhìn": "見る (みる)",
    "Thức, ngủ dậy": "起きる (おきる)",

    // Nhóm 3 (V3 - Động từ bất quy tắc)
    "Đến": "来る (くる)",
    "Làm": "する"
};